Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/Max3263x/DeviceCode/drivers/intc/Max326_Intc.cpp
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// The Samraksh Company
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include <tinyhal.h>
#include <mxc_config.h>
#include <string.h>
//#include <nvic_table.h>
#include "Max326_Intc.h"

////////////////////////////////////////////////////////////////////////////////

#undef  TRACE_ALWAYS
#define TRACE_ALWAYS               0x00000001

#undef  DEBUG_TRACE
#define DEBUG_TRACE (TRACE_ALWAYS)

////////////////////////////////////////////////////////////////////////////////


#if defined(ADS_LINKER_BUG__NOT_ALL_UNUSED_VARIABLES_ARE_REMOVED)
#pragma arm section rwdata = "s_IsrTable_MAX326"
#endif

#define DEFINE_IRQ(index, priority) { priority, { NULL, (void*)(size_t)index } }

#ifdef DEBUG_MAX326_ISR
int interrupt_count[MXC_IRQ_COUNT];
#endif


IRQ_VECTORING __section(rwdata) MAX326_AITC_Driver::s_IsrTable[MXC_IRQ_COUNT] =
{
	DEFINE_IRQ(NonMaskableInt_IRQn, MAX326_AITC::c_IRQ_Priority_5  ), //    = -14, ARM Core : Non-maskable IRQ
	DEFINE_IRQ(HardFault_IRQn , MAX326_AITC::c_IRQ_Priority_5  ), //< ARM Core : Hard Fault IRQ
	DEFINE_IRQ(MemoryManagement_IRQn , MAX326_AITC::c_IRQ_Priority_5  ), //< ARM Core : Memory Management IRQ
	DEFINE_IRQ(BusFault_IRQn , MAX326_AITC::c_IRQ_Priority_5  ), //< ARM Core : Bus Fault IRQ
	DEFINE_IRQ(UsageFault_IRQn , MAX326_AITC::c_IRQ_Priority_5  ), //< ARM Core : Usage Fault IRQ
	DEFINE_IRQ(SVCall_IRQn , MAX326_AITC::c_IRQ_Priority_5  ),  //< ARM Core : SVCall IRQ
	DEFINE_IRQ(DebugMonitor_IRQn , MAX326_AITC::c_IRQ_Priority_5  ),  //< ARM Core : Debug Monitor IRQ
	DEFINE_IRQ(PendSV_IRQn , MAX326_AITC::c_IRQ_Priority_5  ),  //< ARM Core : PendSV IRQ
	DEFINE_IRQ(SysTick_IRQn , MAX326_AITC::c_IRQ_Priority_5  ),  //< ARM Core : SysTick IRQ
	DEFINE_IRQ(CLKMAN_IRQn , MAX326_AITC::c_IRQ_Priority_5  ),          //< CLKMAN
	DEFINE_IRQ(	    PWRMAN_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< PWRMAN
	DEFINE_IRQ(	    FLC_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< Flash Controller
	DEFINE_IRQ(	    RTC0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< RTC Counter match with Compare 0
	DEFINE_IRQ(	    RTC1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< RTC Counter match with Compare 1
	DEFINE_IRQ(	    RTC2_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< RTC Prescaler interval compare match
	DEFINE_IRQ(	    RTC3_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< RTC Overflow
	DEFINE_IRQ(	    PMU_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< Peripheral Management Unit (PMU/DMA)
	DEFINE_IRQ(	    USB_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< USB
	DEFINE_IRQ(	    AES_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< AES
	DEFINE_IRQ(	    MAA_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< MAA
	DEFINE_IRQ(	    WDT0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< Watchdog 0 timeout
	DEFINE_IRQ(	    WDT0_P_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Watchdog 0 pre-window (fed too early)
	DEFINE_IRQ(	    WDT1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< Watchdog 1 timeout
	DEFINE_IRQ(	    WDT1_P_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Watchdog 1 pre-window (fed too early)
	DEFINE_IRQ(	    GPIO_P0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 0
	DEFINE_IRQ(	    GPIO_P1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 1
	DEFINE_IRQ(		GPIO_P2_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 2
	DEFINE_IRQ(	    GPIO_P3_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 3
	DEFINE_IRQ(	    GPIO_P4_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 4
	DEFINE_IRQ(	    GPIO_P5_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 5
	DEFINE_IRQ(	    GPIO_P6_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 6
	DEFINE_IRQ(	    TMR0_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 0 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR0_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 0 (16-bit #1)
	DEFINE_IRQ(	    TMR1_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 1 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR1_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 1 (16-bit #1)
	DEFINE_IRQ(	    TMR2_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 2 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR2_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 2 (16-bit #1)
	DEFINE_IRQ(	    TMR3_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 3 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR3_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 3 (16-bit #1)
	DEFINE_IRQ(	    TMR4_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 4 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR4_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 4 (16-bit #1)
	DEFINE_IRQ(	    TMR5_0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 5 (32-bit, 16-bit #0)
	DEFINE_IRQ(	    TMR5_1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                  //< Timer 5 (16-bit #1)
	DEFINE_IRQ(	    UART0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< UART 0
	DEFINE_IRQ(	    UART1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< UART 1
	DEFINE_IRQ(	    UART2_IRQn, MAX326_AITC::c_IRQ_Priority_1  ),                   //< UART 2
	DEFINE_IRQ(	    UART3_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< UART 3
	DEFINE_IRQ(	    PT_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                      //< Pulse Trains
	DEFINE_IRQ(	    I2CM0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< I2C Master 0
	DEFINE_IRQ(	    I2CM1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< I2C Master 1
	DEFINE_IRQ(	    I2CM2_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< I2C Master 2
	DEFINE_IRQ(	    I2CS_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< I2C Slave
	DEFINE_IRQ(	    SPIM0_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< SPI Master 0
	DEFINE_IRQ(	    SPIM1_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< SPI Master 1
	DEFINE_IRQ(	    SPIM2_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                   //< SPI Master 2
	DEFINE_IRQ(	    SPIB_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< SPI Bridge
	DEFINE_IRQ(	    OWM_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< 1-Wire Master
	DEFINE_IRQ(	    AFE_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                     //< ADC
	DEFINE_IRQ(	    SPIS_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                    //< SPI Slave
	DEFINE_IRQ(	    GPIO_P7_IRQn, MAX326_AITC::c_IRQ_Priority_5  ),                 //< GPIO Port 7
	DEFINE_IRQ(	    GPIO_P8_IRQn,  MAX326_AITC::c_IRQ_Priority_5  ),               //< GPIO Port 8
};

#undef DEFINE_IRQ

