Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/Max3263x/DeviceCode/drivers/intc/Max326_Intc.cpp
#if defined(ADS_LINKER_BUG__NOT_ALL_UNUSED_VARIABLES_ARE_REMOVED)
#pragma arm section rwdata
#endif

////////////////////////////////////////////////////////////////////////////////

void MAX326_AITC_Driver::Initialize()
{

	for(INT32 i = MAX326_AITC::c_MinInterruptIndex ; i <= MAX326_AITC::c_MaxInterruptIndex;i++)
	{
		MAX326_AITC::ClearInterrupt((UINT32)i);
	}

    // // set all priorities to the defaults specified
     IRQ_VECTORING* IsrVector = s_IsrTable;

#ifdef DEBUG_MAX326_ISR
	memset(interrupt_count, 0, sizeof(int)*MXC_IRQ_COUNT);
#endif

    // // set the priority level for each IRQ and stub the IRQ callback
     for (int i=0; i<c_VECTORING_GUARD;i++)
     {
         MAX326_AITC::SetPriority(i, IsrVector[i].Priority );
         IsrVector->Handler.Initialize( STUB_ISRVector, (void*)(size_t)IsrVector->Priority);
     }

}

BOOL MAX326_AITC_Driver::ActivateInterrupt( UINT32 Irq_Index, BOOL Fast, HAL_CALLBACK_FPN ISR, void* ISR_Param)
{
    // figure out the interrupt
    IRQ_VECTORING* IsrVector = IRQToIRQVector( Irq_Index ); if(!IsrVector) return FALSE;
    {
        GLOBAL_LOCK(irq);
        // disable this interrupt while we change it
        MAX326_AITC::DisableInterrupt(Irq_Index);

        // set the vector
        IsrVector->Handler.Initialize( ISR, ISR_Param );
        	// enable the interrupt if we have a vector
        MAX326_AITC::EnableInterrupt(Irq_Index);
    }
    return TRUE;
}

BOOL MAX326_AITC_Driver::DeactivateInterrupt( UINT32 Irq_Index )
{
    // figure out the interrupt
    IRQ_VECTORING* IsrVector = IRQToIRQVector( Irq_Index ); if(!IsrVector) return FALSE;
    {
        GLOBAL_LOCK(irq);
        //MAX326_AITC& AITC = MAX326::AITC();
        // disable this interrupt while we change it
        MAX326_AITC::DisableInterrupt(Irq_Index);
        // as it is stub, just put the Priority to the ISR parameter
        IsrVector->Handler.Initialize( STUB_ISRVector, (void*)(size_t)IsrVector->Priority );
    }
    return TRUE;
}

BOOL MAX326_AITC_Driver::InterruptEnable( UINT32 Irq_Index  )
{
    if(Irq_Index >= c_VECTORING_GUARD ) return FALSE;
    //MAX326_AITC& AITC = MAX326::AITC();
    GLOBAL_LOCK(irq);
    BOOL WasEnabled = MAX326_AITC::IsInterruptEnabled( Irq_Index );
    MAX326_AITC::EnableInterrupt(Irq_Index);
    return WasEnabled;
}

BOOL MAX326_AITC_Driver::InterruptDisable( UINT32 Irq_Index )
{
    if(Irq_Index >= c_VECTORING_GUARD ) return FALSE;
    //MAX326_AITC& AITC = MAX326::AITC();
    GLOBAL_LOCK(irq);
    BOOL WasEnabled = MAX326_AITC::IsInterruptEnabled( Irq_Index );
    MAX326_AITC::DisableInterrupt(Irq_Index);
    return WasEnabled;
}

BOOL MAX326_AITC_Driver::InterruptEnableState( UINT32 Irq_Index )
{
    //MAX326_AITC& AITC = MAX326::AITC();
    return MAX326_AITC::IsInterruptEnabled( Irq_Index );
}

BOOL  MAX326_AITC_Driver::InterruptState( UINT32 Irq_Index )
{
    //MAX326_AITC& AITC = MAX326::AITC();
    return MAX326_AITC::GetInterruptState( Irq_Index );
}

IRQ_VECTORING* MAX326_AITC_Driver::IRQToIRQVector( UINT32 IRQn )
{
    IRQ_VECTORING* IsrVector = s_IsrTable;
    INT32 irq = (INT32)IRQn;
    irq = irq + MAX326_AITC::c_IRQToIndexOffset;
    if (irq < c_VECTORING_GUARD) { return &IsrVector[irq]; }
    return NULL;
}

void MAX326_AITC_Driver::STUB_ISRVector( void* Param )
{
    lcd_printf( "\fSTUB_ISR %08x\r\n", (size_t)Param );
	//Nived :  Calling Default Interrupt Handler
	hal_printf(" Calling Default Interrupt Handler \n");
    HARD_BREAKPOINT();
}




/*
extern "C"
{

	
	void __irq TAMPER_IRQHandler()
	{

		//MAX326_AITC& AITC = MAX326::AITC();

		// set before jumping elsewhere or allowing other interrupts
		SystemState_SetNoLock( SYSTEM_STATE_ISR              );
		SystemState_SetNoLock( SYSTEM_STATE_NO_CONTINUATIONS );
		
#ifdef DEBUG_MAX326_ISR
		interrupt_count[c_IRQ_INDEX_TAMPER]++;
#endif

		MAX326_AITC_Driver::IRQ_VECTORING* IsrVector = &MAX326_AITC_Driver::s_IsrTable[MAX326_AITC::c_IRQ_INDEX_TAMPER];

		IsrVector->Handler.Execute();


		SystemState_ClearNoLock( SYSTEM_STATE_NO_CONTINUATIONS ); // nestable
		SystemState_ClearNoLock( SYSTEM_STATE_ISR              ); // nestable
	}

	void __irq RTC_IRQHandler()
	{
		UINT32 index;

		//MAX326_AITC& AITC = MAX326::AITC();

		GLOBAL_LOCK(irq);
		// set before jumping elsewhere or allowing other interrupts
		SystemState_SetNoLock( SYSTEM_STATE_ISR              );
		SystemState_SetNoLock( SYSTEM_STATE_NO_CONTINUATIONS );
		irq.Release();

#ifdef DEBUG_MAX326_ISR
		interrupt_count[c_IRQ_INDEX_RTC]++;
#endif

		MAX326_AITC_Driver::IRQ_VECTORING* IsrVector = &MAX326_AITC_Driver::s_IsrTable[MAX326_AITC::c_IRQ_INDEX_RTC];

		// In case the interrupt was forced, remove the flag.

		IsrVector->Handler.Execute();

		irq.Acquire();
		SystemState_ClearNoLock( SYSTEM_STATE_NO_CONTINUATIONS ); // nestable
		SystemState_ClearNoLock( SYSTEM_STATE_ISR              ); // nestable
	}

	void __irq FLASH_IRQHandler()
	{

		//MAX326_AITC& AITC = MAX326::AITC();

		// set before jumping elsewhere or allowing other interrupts
		SystemState_SetNoLock( SYSTEM_STATE_ISR              );
		SystemState_SetNoLock( SYSTEM_STATE_NO_CONTINUATIONS );
		
#ifdef DEBUG_MAX326_ISR
		interrupt_count[c_IRQ_INDEX_FLASH]++;
#endif

		MAX326_AITC_Driver::IRQ_VECTORING* IsrVector = &MAX326_AITC_Driver::s_IsrTable[MAX326_AITC::c_IRQ_INDEX_FLASH];

		// In case the interrupt was forced, remove the flag.
		MAX326_AITC::RemoveForcedInterrupt( 0 );

		IsrVector->Handler.Execute();


		SystemState_ClearNoLock( SYSTEM_STATE_NO_CONTINUATIONS ); // nestable
		SystemState_ClearNoLock( SYSTEM_STATE_ISR              ); // nestable
	}
	
	void __irq RCC_IRQHandler()
	{

		//MAX326_AITC& AITC = MAX326::AITC();

		// set before jumping elsewhere or allowing other interrupts
		SystemState_SetNoLock( SYSTEM_STATE_ISR              );
		SystemState_SetNoLock( SYSTEM_STATE_NO_CONTINUATIONS );
		
#ifdef DEBUG_MAX326_ISR
		interrupt_count[c_IRQ_INDEX_RCC]++;
#endif

		MAX326_AITC_Driver::IRQ_VECTORING* IsrVector = &MAX326_AITC_Driver::s_IsrTable[MAX326_AITC::c_IRQ_INDEX_RCC];

		// In case the interrupt was forced, remove the flag.
		MAX326_AITC::RemoveForcedInterrupt( 0 );

		IsrVector->Handler.Execute();


		SystemState_ClearNoLock( SYSTEM_STATE_NO_CONTINUATIONS ); // nestable
		SystemState_ClearNoLock( SYSTEM_STATE_ISR              ); // nestable
	}
	
